{
  "backend/main.mo": "Main actor for the ICP backend that handles user profiles, file references (save/get/remove/list), and blob storage, with role-based access control enforced via an AccessControl mixin.",
  "backend/migration.mo": "Migration module that transforms the old actor state (with extra directory/storage maps) into the new actor state by preserving only the files map.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (Google Photos UI redesign, upload, lightbox, multi-select, etc.) to their relevant frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing one-line summaries of every frontend source file, describing each component's purpose and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell titled 'Personal Data Storage' that mounts the React app at the #root div and loads the main TSX entry point.",
  "frontend/src/App.tsx": "Root React component that gates rendering on Internet Identity auth state, showing a loading spinner, LoginScreen, or PhotoGalleryView with a ProfileSetupModal for new users.",
  "frontend/src/components/AuthScreen.tsx": "Empty file with no content.",
  "frontend/src/components/FileList.tsx": "Empty file with no content.",
  "frontend/src/components/FileManagerDashboard.tsx": "Empty file with no content.",
  "frontend/src/components/FileUploadButton.tsx": "Empty file with no content.",
  "frontend/src/components/LoginScreen.tsx": "Full-page login screen with PhotoVault branding, feature pills (photos, storage, security, formats), and an Internet Identity sign-in button with loading state.",
  "frontend/src/components/MediaGrid.tsx": "Renders a date-grouped grid of media thumbnails (images, videos, files) with support for lazy loading, long-press selection, and skeleton loading states.",
  "frontend/src/components/MediaLightbox.tsx": "Full-screen lightbox overlay for viewing individual media files with navigation, download, share, and file info features.",
  "frontend/src/components/MediaUploadButton.tsx": "Floating action button that handles single-file uploads with progress tracking, saving the file reference to the backend via ExternalBlob.",
  "frontend/src/components/PhotoGalleryView.tsx": "Main gallery page component that composes the navigation bar, section tabs, media grid, lightbox, upload button, selection bar, and settings panel with shared state management.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog shown on first use that prompts the user to enter their name and saves it as their profile via the backend mutation.",
  "frontend/src/components/SectionNavigation.tsx": "Sticky tab bar with Photos, Albums, and Library sections that highlights the active section and calls a callback on change.",
  "frontend/src/components/SelectionActionBar.tsx": "Floating action bar shown during multi-select mode, providing download, share, copy, and delete actions for the selected files with a confirmation dialog for deletion.",
  "frontend/src/components/SettingsPanel.tsx": "Empty file with no content.",
  "frontend/src/components/SettingsPanelGP.tsx": "A slide-out settings panel (Sheet) showing user profile info, storage usage progress bar, and a logout button, with storage quota hardcoded at 1000 TB.",
  "frontend/src/components/StorageUsageBar.tsx": "Empty file with no content or exports.",
  "frontend/src/components/TopNavigationBar.tsx": "A sticky top navigation bar with a logo, search input, and user avatar/dropdown; switches to a selection-mode toolbar showing selected count and select-all when files are being selected.",
  "frontend/src/contexts/AuthContext.tsx": "Empty file with no content or exports.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated (or anonymous) ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, exposing login/logout functions and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for listing files, managing user quota, saving/deleting file references, and reading/writing the caller's user profile via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, configures Tailwind, and defines light/dark theme CSS custom properties (OKLCH color tokens) along with utility classes for media thumbnails and scrollbars.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/fileHelpers.ts": "Provides utility functions for file handling including byte formatting, ICP nanosecond timestamp formatting, storage percentage calculation, and MIME-type-based file icon/label helpers, plus a FileReader-based file-to-Uint8Array converter.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom Google-inspired fonts, an extended oklch-based color palette (including sidebar and chart tokens), custom border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest describing a Google Photos-like media storage app (1000 TB capacity) with its existing features (gallery UI, upload, lightbox, multi-select, storage indicator, theming) and pending feature requests tracked by version."
}